# Taps
tap "hashicorp/tap"

# Development tools
brew "python"
brew "uv"
brew "pnpm"
brew "tmux"
brew "git"
brew "node"  # For Node.js development
brew "yarn"  # Alternative package manager
brew "neovim"  # For terminal-based editing
brew "ripgrep"  # For fast text searching
brew "fd"  # For finding files
brew "fzf"  # For fuzzy finding
brew "hashicorp/tap/terraform"
brew "kubectl"
brew "awscli"

# Productivity tools
cask "cursor"  # IDE
cask "arc"  # Browser
# cask "raycast"  # Productivity launcher
# cask "rectangle"  # Window management
cask "iterm2"  # Terminal emulator
cask "postico"  # Postgres client
cask "postman"  # API testing
cask "slack"  # Communication
cask "notion"  # Note taking